# YOLOv5-Pylon for Low-Resolution Transmission Towers Detection
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

anchors:
  - [10,13, 16,30, 33,23]    # P3/8
  - [30,61, 62,45, 59,119]   # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],   # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],     # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],     # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],     # 5-P4/16
   [-1, 1, MSCA, []],              # 6 <-- 新增多尺度上下文聚合
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],    # 8-P5/32
   [-1, 1, MSCA, []],             # 9 <-- 深层特征增强
   [-1, 3, C3, [1024]],
  ]

head:
  [[-1, 1, CLAttention, [1024]], # 跨层注意力
   [-1, 1, LFRM, []],            # 特征增强
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6, 11], 1, Concat, [1]],  # 注意调整层级索引
   [-1, 3, C3, [512, False]],
   [-1, 1, CLAttention, [512]],
   [-1, 1, LFRM, []],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, C3, [256, False]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 13], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 9], 1, Concat, [1]],
   [-1, 3, C3, [1024, False]],
   [[16, 19, 22], 1, Detect, [nc]],  # Detect(P3, P4, P5)
  ]